In [ ]:
# STEP 1) Install MySQL Server

!apt-get update
!apt-get install mysql-server -y

Hit:1 https://cloud.r-project.org/bin/linux/ubuntu jammy-cran40/ InRelease
Hit:2 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu2204/x86_64  InRelease
Get:3 http://security.ubuntu.com/ubuntu jammy-security InRelease [129 kB]
Hit:4 https://r2u.stat.illinois.edu/ubuntu jammy InRelease
Hit:5 http://archive.ubuntu.com/ubuntu jammy InRelease
Get:6 http://archive.ubuntu.com/ubuntu jammy-updates InRelease [128 kB]
Hit:7 https://ppa.launchpadcontent.net/deadsnakes/ppa/ubuntu jammy InRelease
Hit:8 http://archive.ubuntu.com/ubuntu jammy-backports InRelease
Hit:9 https://ppa.launchpadcontent.net/graphics-drivers/ppa/ubuntu jammy InRelease
Hit:10 https://ppa.launchpadcontent.net/ubuntugis/ppa/ubuntu jammy InRelease
Fetched 257 kB in 2s (131 kB/s)
Reading package lists... Done
W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
mysql-server is already the newest version (8.0.42-0ubuntu0.22.04.1).
0 upgraded, 0 newly installed, 0 to remove and 47 not upgraded.

In [ ]:
# STEP 2: Start MySQL Server
!service mysql start

 * Starting MySQL database server mysqld
   ...done.

In [ ]:
# STEP 3: Set the Root Passwrod

!sudo mysql -e "ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY ''; FLUSH PRIVILEGES;"

In [ ]:
# STEP 4: Install Python MySQL Connector

!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.11/dist-packages (9.3.0)

In [ ]:
# STEP 5: Connect and Use MySQL in Python
import mysql.connector

# Connect to MySQL Server
conn = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = ''
)

cursor = conn.cursor()

# Create Database
cursor.execute("CREATE DATABASE IF NOT EXISTS testdb")
cursor.execute("USE testdb")

In [ ]:
# Example-1: Writing a CREATE Table Statement for a Customer Table
# Drop the table if it already exists (for repeatable testing)

cursor.execute("DROP TABLE IF EXISTS Customer")

create_table_query="""
CREATE TABLE Customer (
  CustomerID VARCHAR(20) NOT NULL,
  CustomerName VARCHAR(10) NOT NULL,
  AGE INT,
  Grade VARCHAR(10) NOT NULL,
  Job VARCHAR(20),
  Points INT DEFAULT 0,
  PRIMARY KEY (CustomerID)
);
"""

cursor.execute(create_table_query)
print("Customer table created.")

Customer table created.

In [ ]:
# Check the structure of the created table, Customer

cursor.execute("DESCRIBE Customer")
columns = cursor.fetchall()

print("\nStructure of 'Customer' Table:")
for column in columns:
  print(column)

# Check the created table, Customer

cursor.execute("SHOW TABLES")
tables = cursor.fetchall()

print("\nList of Tables in the Database:")
for table in tables:
  print(table[0])

Structure of 'Customer' Table:
('CustomerID', 'varchar(20)', 'NO', 'PRI', None, '')
('CustomerName', 'varchar(10)', 'NO', '', None, '')
('AGE', 'int', 'YES', '', None, '')
('Grade', 'varchar(10)', 'NO', '', None, '')
('Job', 'varchar(20)', 'YES', '', None, '')
('Points', 'int', 'YES', '', '0', '')

List of Tables in the Database:
Customer
Grade_Info
Old_Customer

# Example-3: Adding a New Column
- ALTER TABLE table_name'
- ADD column_name data_type [NOT NULL] [DEFAULT default_value]

In [ ]:
alter_query="""
ALTER TABLE Customer
ADD COLUMN Email VARCHAR(50)
"""

cursor.execute(alter_query)
print("Customer table altered.")

cursor.execute("DESCRIBE Customer")

print("\nUpdated Customer Table Structure:")
for row in cursor.fetchall():
  print(row)

Customer table altered.

Updated Customer Table Structure:
('CustomerID', 'varchar(20)', 'NO', 'PRI', None, '')
('CustomerName', 'varchar(10)', 'NO', '', None, '')
('AGE', 'int', 'YES', '', None, '')
('Grade', 'varchar(10)', 'NO', '', None, '')
('Job', 'varchar(20)', 'YES', '', None, '')
('Points', 'int', 'YES', '', '0', '')
('Email', 'varchar(50)', 'YES', '', None, '')

# Example-4: Dropping an Existing Column
- ALTER TABLE table_name
- DROP COLUMN column_name;

In [ ]:
alter_query="""
ALTER TABLE Customer
DROP COLUMN Email
"""
cursor.execute(alter_query)
print("Customer table droped.")

cursor.execute("DESCRIBE Customer")
print("\nUpdated Customer Table Structure:")

for row in cursor.fetchall():
  print(row)

Customer table droped.

Updated Customer Table Structure:
('CustomerID', 'varchar(20)', 'NO', 'PRI', None, '')
('CustomerName', 'varchar(10)', 'NO', '', None, '')
('AGE', 'int', 'YES', '', None, '')
('Grade', 'varchar(10)', 'NO', '', None, '')
('Job', 'varchar(20)', 'YES', '', None, '')
('Points', 'int', 'YES', '', '0', '')

In [ ]:
alter_query = """
ALTER TABLE Customer
ADD CONSTRAINT check_age CHECK (AGE >= 20);
"""

print("Customer table constrained")

cursor.execute("SHOW CREATE TABLE Customer")
result = cursor.fetchone()

print("\n Table Definition:")
print(result[1])

Customer table constrained

 Table Definition:
CREATE TABLE `Customer` (
  `CustomerID` varchar(20) NOT NULL,
  `CustomerName` varchar(10) NOT NULL,
  `AGE` int DEFAULT NULL,
  `Grade` varchar(10) NOT NULL,
  `Job` varchar(20) DEFAULT NULL,
  `Points` int DEFAULT '0',
  PRIMARY KEY (`CustomerID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

In [ ]:
drop_constraint_query = """
ALTER TABLE Customer
DROP CONSTRAINT check_age;
"""

# cursor.execute(drop_constraint_query)

In [ ]:
cursor.execute("SHOW CREATE TABLE Customer")
result = cursor.fetchone()
print(result[1])

CREATE TABLE `Customer` (
  `CustomerID` varchar(20) NOT NULL,
  `CustomerName` varchar(10) NOT NULL,
  `AGE` int DEFAULT NULL,
  `Grade` varchar(10) NOT NULL,
  `Job` varchar(20) DEFAULT NULL,
  `Points` int DEFAULT '0',
  PRIMARY KEY (`CustomerID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

In [ ]:
# INSERT INTO VALUES ~ 1

insert_query = """
INSERT
INTO Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
VALUES (%s, %s, %s, %s, %s, %s);
"""

values=('C001', 'Alice', 30, 'Gold', 'Engineer', 1000)
cursor.execute(insert_query, values)
conn.commit()

In [ ]:
# INSERT INTO VALUES ~ 2

insert_query = """
INSERT
INTO Customer (CustomerID, CustomerName, Age, Grade, Job)
VALUES (%s, %s, %s, %s, %s);
"""

values= ('C002', 'Bob', 28, 'Silver', 'Designer')
cursor.execute(insert_query, values)
conn.commit()

In [ ]:
cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

for row in rows:
  print(row)

('C001', 'Alice', 30, 'Gold', 'Engineer', 1000)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)

In [ ]:
insert_query = """
INSERT INTO Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
VALUES (%s, %s, %s, %s, %s, %s);
"""

data = [
    ('C003', 'Park', 21, 'VIP', 'Developer', 2000),
    ('C004', 'Kim', 25, 'VIP', 'Doctor', 800)
]

cursor.executemany(insert_query, data)
conn.commit()

In [ ]:
cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

print("\nCustomer Table Data:")
for row in rows:
  print(row)

Customer Table Data:
('C001', 'Alice', 30, 'Gold', 'Engineer', 1000)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2000)
('C004', 'Kim', 25, 'VIP', 'Doctor', 800)

In [ ]:
cursor = conn.cursor()


cursor.execute("DROP TABLE IF EXISTS Old_Customer")
cursor.execute("""
CREATE TABLE Old_Customer (
  CustomerID VARCHAR(20),
  CustomerName VARCHAR(20),
  AGE INTEGER,
  Grade VARCHAR(10),
  Job VARCHAR(20),
  Points INTEGER
  );
""")

In [ ]:
insert_old="""
INSERT INTO Old_Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
VALUES (%s, %s, %s, %s, %s, %s);
"""

old_data = ('C005', 'LEE', 45, 'Gold', 'Engineer', 3000)
cursor.execute(insert_old, old_data)
conn.commit()

In [ ]:
cursor.execute("SELECT * FROM Old_Customer")
rows = cursor.fetchall()

print("\nOld_Customer Table Data:")
for row in rows:
  print(row)

Old_Customer Table Data:
('C005', 'LEE', 45, 'Gold', 'Engineer', 3000)

In [ ]:
subquery = """
INSERT INTO Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
SELECT CustomerID, CustomerName, Age, Grade, Job, Points
FROM Old_Customer;
"""

cursor.execute(subquery)

cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

print("\nCustomer Table Data:")
for row in rows:
  print(row)

Customer Table Data:
('C001', 'Alice', 30, 'Gold', 'Engineer', 1000)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2000)
('C004', 'Kim', 25, 'VIP', 'Doctor', 800)
('C005', 'LEE', 45, 'Gold', 'Engineer', 3000)

In [ ]:
# Column 보여주는 명령어
# col[0]가 column name 부분임

cursor.execute("SHOW columns in Customer")
columns = [col[0] for col in cursor.fetchall()]

print(columns)

['CustomerID', 'CustomerName', 'AGE', 'Grade', 'Job', 'Points']

In [ ]:
# UPDATE Statement
"""
UPDATE table_name
SET column1 = value1, column2 = value2, ...
[WHERE condition];
"""

# Example-11: UPDATE Statement
# CustomerID가 'C001'인 row를 grade가 gold에서 silver로 업데이트

update_query = """
 UPDATE Customer
 SET Grade = 'Silver'
 WHERE CustomerID = 'C001';
"""

cursor.execute(update_query)

cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

print("\nCustomer Table Data: ")
for row in rows:
  print(row)

Customer Table Data:
('C001', 'Alice', 30, 'Silver', 'Engineer', 1000)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2000)
('C004', 'Kim', 25, 'VIP', 'Doctor', 800)
('C005', 'LEE', 45, 'Gold', 'Engineer', 3000)

In [ ]:
# Example-12
# 모든 customer의 points를 20% increase 할 것

update_query = """
 UPDATE Customer
 SET Points = Points * 1.2
"""

cursor.execute(update_query)

cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

print("\nCustomer Table Data: ")
for row in rows:
  print(row)

Customer Table Data:
('C001', 'Alice', 30, 'Silver', 'Engineer', 1200)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2400)
('C004', 'Kim', 25, 'VIP', 'Doctor', 960)
('C005', 'LEE', 45, 'Gold', 'Engineer', 3600)

In [ ]:
# DELETE Statement
"""
DELETE
FROM table_name
[WHERE_ condition];
"""

# Example-14
# Kim, Park, Yoon 행 추가하기
insert_query = """
 INSERT
 INTO Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
 VALUES (%s, %s, %s, %s, %s, %s)
"""

value1 = ('C006', 'Kim', 22, 'Silver', 'Artist', 1500)
cursor.execute(insert_query, value1)
conn.commit()
value1 = ('C007', 'Park', 50, 'VIP', 'Artist', 7000)
cursor.execute(insert_query, value1)
conn.commit()
value1 = ('C008', 'Yoon', 60, 'VIP', 'Artist', 10000)
cursor.execute(insert_query, value1)
conn.commit()

cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

for row in rows:
  print(row)

('C001', 'Alice', 30, 'Silver', 'Engineer', 1200)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2400)
('C004', 'Kim', 25, 'VIP', 'Doctor', 960)
('C005', 'LEE', 45, 'Gold', 'Engineer', 3600)
('C006', 'Kim', 22, 'Silver', 'Artist', 1500)
('C007', 'Park', 50, 'VIP', 'Artist', 7000)
('C008', 'Yoon', 60, 'VIP', 'Artist', 10000)

In [ ]:
# Example-15
# subquery 사용해서 Job이 Artist인 사람 삭제하기

delete_query = """
 DELETE
 FROM Customer
 WHERE
"""

cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

for row in rows:
  print(row)

('C001', 'Alice', 30, 'Silver', 'Engineer', 1200)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2400)
('C004', 'Kim', 25, 'VIP', 'Doctor', 960)
('C005', 'LEE', 45, 'Gold', 'Engineer', 3600)
('C006', 'Kim', 22, 'Silver', 'Artist', 1500)
('C007', 'Park', 50, 'VIP', 'Artist', 7000)
('C008', 'Yoon', 60, 'VIP', 'Artist', 10000)

In [ ]:
# # DELETE Statement
# """
# DELETE FROM table name
# [WHERE condition];
# """

# insert_query = """
# INSERT
# INTO Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
# VALUES (%s, %s, %s, %s, %s, %s);
# """
# values = ('C006', 'Kim', 22, 'Silver', 'Artist', 1500)
# cursor.execute(insert_query, values)
# conn.commit()
# values_2 = ('C007', 'Park', 50, 'VIP', 'Artist', 7000)
# cursor.execute(insert_query, values_2)
# conn.commit()
# values_3 = ('C008', 'Yoon', 60, 'VIP', 'Artist', 10000)
# cursor.execute(insert_query, values_3)
# conn.commit()

# cursor.execute("SELECT * FROM Customer")
# rows = cursor.fetchall()

# print("\nCustomer Table Data:")
# for row in rows:
#   print(row)

In [ ]:

delete_query = """
DELETE FROM Customer
WHERE CustomerID IN (
  SELECT * FROM (
  SELECT CustomerID
  FROM Customer
  WHERE Job = 'Artist'
  ) AS temp_sub
);
"""

cursor.execute(delete_query)
_ = cursor.fetchall()
cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()

print("\nCustomer Table Data:")
for row in rows:
  print(row)

Customer Table Data:
('C001', 'Alice', 30, 'Silver', 'Engineer', 1200)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2400)
('C004', 'Kim', 25, 'VIP', 'Doctor', 960)
('C005', 'LEE', 45, 'Gold', 'Engineer', 3600)

In [ ]:
# # Example-15: DELETE Statement using a subquery

# delete_query = """
# DELETE FROM Customer
# WHERE CustomerID IN (
#   SELECT * FROM (
#   SELECT CustomerID
#   FROM Customer
#   WHERE Job = 'Artist'
#   )
# );

# """
# cursor.execute(delete_query)
# conn.commit()
# cursor.execute("SELECT * FROM Customer")
# rows = cursor.fetchall()

# print("\nCustomer Table Data:")
# for row in rows:
#   print(row)

In [ ]:
# SELECT STATEMENT
"""
SELECT [**ALL** | **DISTINCT**] column_list
FROM table_list;
"""

# Example-16
# CustomerID, CustomerName, Grade를 Customer 테이블에서 가져오기
# Customer의 모든 column을 테이블에서 가져오기

select_query = """
SELECT CustomerID, CustomerName, Grade
FROM Customer
"""

cursor.execute(select_query)

_ = cursor.fetchall()
for row in _:
  print(row)
cursor.execute("SELECT * FROM Customer")
rows = cursor.fetchall()


for row in rows:
  print(row)

('C001', 'Alice', 'Silver')
('C002', 'Bob', 'Silver')
('C003', 'Park', 'VIP')
('C004', 'Kim', 'VIP')
('C005', 'LEE', 'Gold')
('C001', 'Alice', 30, 'Silver', 'Engineer', 1200)
('C002', 'Bob', 28, 'Silver', 'Designer', 0)
('C003', 'Park', 21, 'VIP', 'Developer', 2400)
('C004', 'Kim', 25, 'VIP', 'Doctor', 960)
('C005', 'LEE', 45, 'Gold', 'Engineer', 3600)

In [ ]:
# Example-17
# 1. customer name과 jobs을 가져오기
# 2. customer name과 jobs를 ALL 키워드를 통해 가져오기
# 3. job을 DISTINCT로 unique하게 가져오기

first_select_query = """
 SELECT CustomerName, Job
 FROM Customer
"""

cursor.execute(first_select_query)

rows = cursor.fetchall()

for row in rows:
  print(row)

second_select_query = """
 SELECT ALL CustomerName, Job
 FROM Customer
"""

cursor.execute(second_select_query)

rows = cursor.fetchall()

for row in rows:
  print(row)

third_select_query = """
 SELECT DISTINCT Job
 FROM Customer;
"""

cursor.execute(third_select_query)

rows = cursor.fetchall()

for row in rows:
  print(row)

('Alice', 'Engineer')
('Bob', 'Designer')
('Park', 'Developer')
('Kim', 'Doctor')
('LEE', 'Engineer')
('Alice', 'Engineer')
('Bob', 'Designer')
('Park', 'Developer')
('Kim', 'Doctor')
('LEE', 'Engineer')
('Engineer',)
('Designer',)
('Developer',)
('Doctor',)

In [ ]:
# STATE Statement: Renaming Columns Using AS
"""
SELECT column_name **AS** alias_name
FROM table_name;
"""

# Example-18
# CustomerName을 Name으로 column name을 변경하기

select_query = """
 SELECT CustomerName AS Name
 FROM Customer
"""

cursor.execute(select_query)

rows = cursor.fetchall()

# Renaming된 column 명을 확인하기 위한 코드
print([desc[0] for desc in cursor.description])

cursor.execute("SHOW columns in Customer")
columns = [col[0] for col in cursor.fetchall()]

print(columns)

['Name']
['CustomerID', 'CustomerName', 'AGE', 'Grade', 'Job', 'Points']

In [ ]:
# SELECT Statement
# Using Arithmetic Expressions in Queries

# +,-,*,/,상수로 산술 연산 가능
# Result Table에서만 보이고 실제로 update는 아님

# Example-19
# CustomerName, Points + 1000을 해서 결과 보이기

from tabulate import tabulate

select_query = """
 SELECT CustomerName, Points+1000 AS Score
 FROM Customer;
"""

cursor.execute(select_query)

rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]


print(tabulate(rows, headers=columns, tablefmt="psql"))

+----------------+---------+
| CustomerName   |   Score |
|----------------+---------|
| Alice          |    2200 |
| Bob            |    1000 |
| Park           |    3400 |
| Kim            |    1960 |
| LEE            |    4600 |
+----------------+---------+

In [ ]:
# Example-20
# Conditional Query

# 1.4000보다 큰 Points 조건에서 ID,Name, Age 가져오기
# 2. Grade가 VIP 또는 Points가 4000보다 크거나 같은 customers 가져오기
# 3. Points가 2000과 4000 사이에 있는 customers 가져오기

first_select_query = """
 SELECT CustomerID, CustomerName AS Name, Age
 FROM Customer
 WHERE Points > 2000
"""

cursor.execute(first_select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

second_select_query = """
 SELECT * FROM Customer
 WHERE Grade = 'VIP' OR Points >= 2000
"""

cursor.execute(second_select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

third_select_query = """
 SELECT * FROM Customer
 WHERE 2000 < Points AND Points < 4000
"""

cursor.execute(third_select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

+--------------+--------+-------+
| CustomerID   | Name   |   Age |
|--------------+--------+-------|
| C003         | Park   |    21 |
| C005         | LEE    |    45 |
+--------------+--------+-------+
+--------------+----------------+-------+---------+-----------+----------+
| CustomerID   | CustomerName   |   AGE | Grade   | Job       |   Points |
|--------------+----------------+-------+---------+-----------+----------|
| C003         | Park           |    21 | VIP     | Developer |     2400 |
| C004         | Kim            |    25 | VIP     | Doctor    |      960 |
| C005         | LEE            |    45 | Gold    | Engineer  |     3600 |
+--------------+----------------+-------+---------+-----------+----------+
+--------------+----------------+-------+---------+-----------+----------+
| CustomerID   | CustomerName   |   AGE | Grade   | Job       |   Points |
|--------------+----------------+-------+---------+-----------+----------|
| C003         | Park           |    21 | VIP     | Developer |     2400 |
| C005         | LEE            |    45 | Gold    | Engineer  |     3600 |
+--------------+----------------+-------+---------+-----------+----------+

In [ ]:
# SELECT STATEMENT
# Searching with LIKE

# %: 문자 0개 이상 매칭
# _: 정확히 문자 1개 매칭

# Example-21
# names, ages, grades, points를 가져옴
# 단, 이름이 A 또는 B로 시작해야함

select_query = """
 SELECT CustomerName AS Name, Age, Grade, Points
 FROM Customer
 WHERE CustomerName LIKE 'A%' OR CustomerName LIKE 'B__'
"""

cursor.execute(select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

+--------+-------+---------+----------+
| Name   |   Age | Grade   |   Points |
|--------+-------+---------+----------|
| Alice  |    30 | Silver  |     1200 |
| Bob    |    28 | Silver  |        0 |
+--------+-------+---------+----------+

In [ ]:
# Example-22
# CustomerName, Age, Grade를 찾음
# 단, 3글자로 구성되어야함

select_query = """
 SELECT CustomerName, Age, Grade
 FROM Customer
 WHERE CustomerName LIKE '___'
"""
cursor.execute(select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

+----------------+-------+---------+
| CustomerName   |   Age | Grade   |
|----------------+-------+---------|
| Bob            |    28 | Silver  |
| Kim            |    25 | VIP     |
| LEE            |    45 | Gold    |
+----------------+-------+---------+

In [ ]:
# Example-23
# Searching with Null Condition
# IS NULL, IS NOT NULL

# 1. Age가 NULL인 것 찾기
# 2. Age가 NULL 아닌 것 찾기

select_query = """
 SELECT CustomerName
 FROM Customer
 WHERE Age IS NULL;
"""

cursor.execute(select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

select_query = """
 SELECT CustomerName
 FROM Customer
 WHERE Age IS NOT NULL;
"""
cursor.execute(select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

+----------------+
| CustomerName   |
|----------------|
+----------------+
+----------------+
| CustomerName   |
|----------------|
| Alice          |
| Bob            |
| Park           |
| Kim            |
| LEE            |
+----------------+

In [ ]:
# Sorting Search Results
# ORDER BY ASC, DESC
# ASC: NULL은 제일 뒤에 나타남
# DESC: NULL은 제일 앞에 나타남
# 여러 column 기준으로 정렬할 때 두 행이 같은 값이면 첫 번째 column이 먼저 기준됨.

# Example-24: Sorting Search Results
# Age를 내림차순 정렬해서 Name, Grade, Age 가져오기

# 1. Name, Grade, Age를 가져오는데 Age를 내림차순으로 정렬해서 가져오기

select_query = """
 SELECT CustomerName, Grade, Age
 FROM Customer
 ORDER BY Age DESC
"""

cursor.execute(select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

# 2. Age를 내림차순으로 가져오고 동일 나이 있으면 Points를 내림차순으로 가져오기
# + Points가 2000 이상인거 가져오기

select_query = """
 SELECT *
 FROM Customer
 WHERE Points >= 2000
 ORDER BY Age ASC, Points DESC;
"""

cursor.execute(select_query)
rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

+----------------+---------+-------+
| CustomerName   | Grade   |   Age |
|----------------+---------+-------|
| LEE            | Gold    |    45 |
| Alice          | Silver  |    30 |
| Bob            | Silver  |    28 |
| Kim            | VIP     |    25 |
| Park           | VIP     |    21 |
+----------------+---------+-------+
+--------------+----------------+-------+---------+-----------+----------+
| CustomerID   | CustomerName   |   AGE | Grade   | Job       |   Points |
|--------------+----------------+-------+---------+-----------+----------|
| C003         | Park           |    21 | VIP     | Developer |     2400 |
| C005         | LEE            |    45 | Gold    | Engineer  |     3600 |
+--------------+----------------+-------+---------+-----------+----------+

In [ ]:
delete_query = """
 DELETE
 FROM Customer
 WHERE CustomerID='C006'
"""

cursor.execute(delete_query)

In [ ]:
# Example-25
# 1. 21살이고 3000점 points를 가지는 Yoon이라는 사람 새롭게 넣기

# 2. Points가 2000 이상인 customer를 가져오고, Age를 오름차순으로 가져오고, Points를 내림차순으로 정렬

insert_query = """
 INSERT
 INTO Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
 VALUES (%s, %s, %s, %s, %s, %s)
"""

values = ('C006', 'Yoon', 21, 'Silver', 'Engineer', 3000)

cursor.execute(insert_query, values)

select_query = """
 SELECT *
 FROM Customer
 WHERE Points >= 2000
 ORDER BY Age ASC, Points DESC
"""

cursor.execute(select_query)

rows = cursor.fetchall()

columns = [desc[0] for desc in cursor.description]

print(tabulate(rows, headers=columns, tablefmt='psql'))

+--------------+----------------+-------+---------+-----------+----------+
| CustomerID   | CustomerName   |   AGE | Grade   | Job       |   Points |
|--------------+----------------+-------+---------+-----------+----------|
| C006         | Yoon           |    21 | Silver  | Engineer  |     3000 |
| C003         | Park           |    21 | VIP     | Developer |     2400 |
| C005         | LEE            |    45 | Gold    | Engineer  |     3600 |
+--------------+----------------+-------+---------+-----------+----------+

In [ ]:
select_query = """
 SELECT *
 FROM Customer
 WHERE Points >= 2000
 ORDER BY Age ASC, Points DESC
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

+--------------+----------------+-------+---------+-----------+----------+
| CustomerID   | CustomerName   |   AGE | Grade   | Job       |   Points |
|--------------+----------------+-------+---------+-----------+----------|
| C006         | Yoon           |    21 | Silver  | Engineer  |     3000 |
| C003         | Park           |    21 | VIP     | Developer |     2400 |
| C005         | LEE            |    45 | Gold    | Engineer  |     3600 |
+--------------+----------------+-------+---------+-----------+----------+

In [ ]:
# Searching with Aggregate Functions
# COUNT, SUM, AVG, MAX, MIN

# Example-26: Searching with Aggregate Functions
# Customer Table의 AVG 가져오기

# 1. Customer Table에서 AVG Points를 가져오기
# 2. Customer Table에서 Job이 Engineer인 사람중 Points의 Total 구하기

select_query = """
 SELECT AVG(Points) AS 'AVG Points'
 FROM Customer
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

select_query = """
 SELECT SUM(Points) AS 'Total Points'
 FROM Customer
 WHERE Job = 'Engineer'
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

+--------------+
|   AVG Points |
|--------------|
|         1860 |
+--------------+
+----------------+
|   Total Points |
|----------------|
|           7800 |
+----------------+

In [ ]:
delete_query = """
 DELETE
 FROM Customer
 WHERE CustomerID='C007'
"""

cursor.execute(delete_query)

In [ ]:
# Example-27
# CustomerID, Age, *로 COUNT 해보기

# 1. 새로운 행을 insert하는데 Age가 NULL인 값으로 넣기

insert_query = """
 INSERT
 INTO Customer (CustomerID, CustomerName, Age, Grade, Job, Points)
 VALUES (%s, %s, NULL, %s, %s, %s)
"""

values = ('C007', 'Park', 'Gold', 'Artist', 1200)

cursor.execute(insert_query, values)

quries = {
    "Count using CustomerID ": "SELECT COUNT(CustomerID) AS 'Total Customers' FROM Customer;",
    "Count using Age ": "SELECT COUNT(Age) AS 'Customers with Age' FROM Customer;",
    "Count using * ": "SELECT COUNT(*) AS 'Total Rows' FROM Customer;",
}

for title, row in quries.items():
  print(f"{title}")
  cursor.execute(row)
  rows = cursor.fetchall()
  columns = [desc[0] for desc in cursor.description]
  print(tabulate(rows, headers=columns, tablefmt='psql'))

Count using CustomerID
+-------------------+
|   Total Customers |
|-------------------|
|                 7 |
+-------------------+
Count using Age
+----------------------+
|   Customers with Age |
|----------------------|
|                    6 |
+----------------------+
Count using *
+--------------+
|   Total Rows |
|--------------|
|            7 |
+--------------+

In [ ]:
# quries = """
# "Count using Customer ID": "{query}" ...
# """

"""
for title, query in queies.items():
  cursor.execute(query)
  rows = cursor.fetchall()
  columns = [desc[0] for desc in cursor.description]
  print(f"{title}")
  print(tabulate(rows, headers=columns, tablefmt='psql'))
"""

select_query = """
 SELECT COUNT(CustomerID) AS 'Total Customers'
 FROM Customer
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

select_query = """
 SELECT COUNT(Age) AS 'Customer with Age'
 FROM Customer
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

select_query = """
 SELECT COUNT(*) AS 'Total Rows'
 FROM Customer
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

+-------------------+
|   Total Customers |
|-------------------|
|                 7 |
+-------------------+
+---------------------+
|   Customer with Age |
|---------------------|
|                   6 |
+---------------------+
+--------------+
|   Total Rows |
|--------------|
|            7 |
+--------------+

In [ ]:
# Grouped Search
# GROUP BY
# SELECT [ALL | DISTINCT] column_list
# FROM table_list
# [WHERE condition]
# [GROUP BY column_list [HAVING condition]]
# [ORDER BY column_list [ASC | DESC]];

# Example-28
# Customer Table에서 GROUP BY를 통해 각 Job의 total Points를 가져오기 (SUM 사용)

select_query = """
 SELECT Job, SUM(POINTS) AS 'TotalPoints'
 FROM Customer
 GROUP BY Job
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

+-----------+---------------+
| Job       |   TotalPoints |
|-----------+---------------|
| Engineer  |          7800 |
| Designer  |             0 |
| Developer |          2400 |
| Doctor    |           960 |
| Artist    |          1200 |
+-----------+---------------+

In [ ]:
# Example-29
# Grade별로 Job의 수와, Points의 최대값 출력하게하기

select_query = """
 SELECT Grade, COUNT(DISTINCT Job) AS 'Number of Jobs', MAX(DISTINCT Points) AS 'Max Point'
 FROM Customer
 GROUP BY Grade
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

+---------+------------------+-------------+
| Grade   |   Number of Jobs |   Max Point |
|---------+------------------+-------------|
| Gold    |                2 |        3600 |
| Silver  |                2 |        3000 |
| VIP     |                2 |        2400 |
+---------+------------------+-------------+

In [ ]:
# Example-30: Join Queries for Multiple Tables
# Grade_Info Table을 만들어서 Job이 Engineer, discount rate를 Join하기

# Step 1) Table 생성
cursor = conn.cursor()
# cursor.execute("""
#  CREATE TABLE IF NOT EXISTS Grade_Info(
#   Grade VARCHAR(10) PRIMARY KEY,
#   DiscountRate INT
#  )
# """)

# Step 2) 값 Insert
# cursor.executemany("""
#  INSERT INTO Grade_Info (Grade, DiscountRate) VALUES (%s, %s)
# """, [('Silver', 10), ('Gold', 20), ('VIP', 30)]
# )

# Step 3) 외래키 등록
# cursor.execute("""
#  ALTER TABLE Customer
#  ADD CONSTRAINT fk_customer_grade
#  FOREIGN KEY (Grade)
#  REFERENCES Grade_Info(Grade);
# """
# )

conn.commit()

# Step 4) JOIN을 통한 테이블 조회
select_query = """
 SELECT *
 FROM Customer
 JOIN Grade_Info
 ON Customer.Grade = Grade_Info.Grade
 WHERE Customer.Job = 'Engineer';
"""

cursor.execute(select_query)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
print(tabulate(rows, headers=columns, tablefmt='psql'))

+--------------+----------------+-------+---------+----------+----------+---------+----------------+
| CustomerID   | CustomerName   |   AGE | Grade   | Job      |   Points | Grade   |   DiscountRate |
|--------------+----------------+-------+---------+----------+----------+---------+----------------|
| C001         | Alice          |    30 | Silver  | Engineer |     1200 | Silver  |             10 |
| C005         | LEE            |    45 | Gold    | Engineer |     3600 | Gold    |             20 |
| C006         | Yoon           |    21 | Silver  | Engineer |     3000 | Silver  |             10 |
+--------------+----------------+-------+---------+----------+----------+---------+----------------+